backend/load-tests/scenarios.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Browse products and add to cart"
    flow:
      - get:
          url: "/api/products"
      - think: 2
      - get:
          url: "/api/products/categories"
      - think: 1
      - get:
          url: "/api/products/{{$randomString(24)}}"
      
  - name: "User authentication flow"
    flow:
      - post:
          url: "/api/users/login"
          json:
            email: "test@example.com"
            password: "password123"
      - think: 1
      - get:
          url: "/api/users/profile"
          headers:
            Authorization: "Bearer {{token}}"